# Используем официальный образ Node.js в качестве базового образа
FROM node:18

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json в рабочую директорию
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем остальной исходный код в рабочую директорию
COPY . .

# Устанавливаем переменные окружения (если требуется)
ENV NODE_ENV=production

# Запускаем команду для запуска приложения
CMD ["node", "bot.js"]